# IFCHybridImport Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCHybridImport Constructor
IFCHybridImport Class See Also
---
Constructs a new IFCHybridImport instance for importing IFC via Hybrid method.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public IFCHybridImport()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
IFCHybridImport()
```

# See Also
IFCHybridImport Class
Autodesk.Revit.DB.IFC Namespace